{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Dense","config":{"units":23,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,8],"dtype":"float32"}},{"class_name":"Dense","config":{"units":15,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"Dense","config":{"units":7,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}}]},"keras_version":"tfjs-layers 2.7.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.7.0","convertedBy":null,"userDefinedMetadata":{"projectID":"x000","modelID":"b5348b05-755d-4443-8365-bdb1dc4ca260"},"weightsManifest":[{"paths":["./b5348b05-755d-4443-8365-bdb1dc4ca260.weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[8,23],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[23],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[23,15],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[15,7],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[7],"dtype":"float32"}]}]}